; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=150, out_folder=./training, instance_id=3, seed=2027, goal_proportion=0.03

(define (problem blocksworld-03)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 - object)
 (:init 
    (arm-empty)
    (clear b106)
    (on b106 b40)
    (on b40 b98)
    (on b98 b26)
    (on b26 b57)
    (on b57 b127)
    (on b127 b145)
    (on b145 b120)
    (on b120 b3)
    (on b3 b142)
    (on-table b142)
    (clear b75)
    (on-table b75)
    (clear b64)
    (on b64 b86)
    (on b86 b136)
    (on b136 b43)
    (on-table b43)
    (clear b117)
    (on-table b117)
    (clear b115)
    (on b115 b143)
    (on-table b143)
    (clear b118)
    (on b118 b92)
    (on-table b92)
    (clear b112)
    (on b112 b32)
    (on b32 b27)
    (on b27 b122)
    (on b122 b123)
    (on b123 b91)
    (on-table b91)
    (clear b82)
    (on-table b82)
    (clear b62)
    (on b62 b135)
    (on b135 b37)
    (on-table b37)
    (clear b140)
    (on b140 b137)
    (on b137 b6)
    (on b6 b7)
    (on b7 b77)
    (on b77 b114)
    (on-table b114)
    (clear b52)
    (on b52 b89)
    (on b89 b97)
    (on b97 b38)
    (on b38 b116)
    (on b116 b132)
    (on-table b132)
    (clear b126)
    (on b126 b67)
    (on-table b67)
    (clear b141)
    (on b141 b139)
    (on b139 b134)
    (on b134 b87)
    (on b87 b138)
    (on b138 b55)
    (on-table b55)
    (clear b56)
    (on b56 b14)
    (on b14 b80)
    (on b80 b31)
    (on b31 b53)
    (on-table b53)
    (clear b105)
    (on b105 b149)
    (on b149 b19)
    (on-table b19)
    (clear b33)
    (on b33 b24)
    (on b24 b81)
    (on b81 b22)
    (on b22 b110)
    (on b110 b1)
    (on-table b1)
    (clear b85)
    (on b85 b70)
    (on b70 b2)
    (on-table b2)
    (clear b58)
    (on b58 b125)
    (on b125 b17)
    (on b17 b107)
    (on b107 b147)
    (on b147 b69)
    (on b69 b93)
    (on-table b93)
    (clear b84)
    (on b84 b39)
    (on b39 b15)
    (on-table b15)
    (clear b5)
    (on b5 b150)
    (on b150 b30)
    (on b30 b63)
    (on-table b63)
    (clear b9)
    (on b9 b96)
    (on b96 b65)
    (on b65 b72)
    (on b72 b131)
    (on-table b131)
    (clear b146)
    (on b146 b11)
    (on b11 b10)
    (on b10 b76)
    (on b76 b35)
    (on b35 b23)
    (on-table b23)
    (clear b12)
    (on b12 b73)
    (on-table b73)
    (clear b50)
    (on b50 b54)
    (on b54 b36)
    (on b36 b13)
    (on b13 b68)
    (on b68 b34)
    (on b34 b61)
    (on b61 b42)
    (on b42 b8)
    (on b8 b100)
    (on b100 b25)
    (on-table b25)
    (clear b99)
    (on-table b99)
    (clear b16)
    (on-table b16)
    (clear b124)
    (on b124 b79)
    (on-table b79)
    (clear b128)
    (on b128 b101)
    (on b101 b95)
    (on b95 b48)
    (on b48 b60)
    (on b60 b102)
    (on b102 b111)
    (on b111 b148)
    (on b148 b49)
    (on b49 b129)
    (on b129 b51)
    (on b51 b29)
    (on b29 b121)
    (on-table b121)
    (clear b45)
    (on-table b45)
    (clear b108)
    (on b108 b44)
    (on b44 b113)
    (on b113 b94)
    (on b94 b41)
    (on b41 b59)
    (on-table b59)
    (clear b130)
    (on b130 b109)
    (on b109 b133)
    (on b133 b66)
    (on b66 b18)
    (on b18 b78)
    (on b78 b88)
    (on b88 b20)
    (on b20 b74)
    (on b74 b71)
    (on b71 b46)
    (on b46 b90)
    (on b90 b144)
    (on-table b144)
    (clear b103)
    (on-table b103)
    (clear b47)
    (on-table b47)
    (clear b104)
    (on-table b104)
    (clear b83)
    (on-table b83)
    (clear b4)
    (on b4 b21)
    (on b21 b119)
    (on-table b119)
    (clear b28)
    (on-table b28))
 (:goal  (and 
    (clear b1)
    (on-table b1)
    (clear b3)
    (on-table b3)
    (clear b4)
    (on b4 b2)
    (on-table b2))))

; plan
1. (unstack b106 b40)
   deleted: (on b106 b40) (clear b106) (arm-empty)
   added: (holding b106) (clear b40)
   goals met: 3 of 7
2. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 3 of 7
3. (unstack b33 b24)
   deleted: (on b33 b24) (clear b33) (arm-empty)
   added: (holding b33) (clear b24)
   goals met: 3 of 7
4. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 3 of 7
5. (unstack b24 b81)
   deleted: (on b24 b81) (clear b24) (arm-empty)
   added: (holding b24) (clear b81)
   goals met: 3 of 7
6. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 3 of 7
7. (unstack b40 b98)
   deleted: (on b40 b98) (clear b40) (arm-empty)
   added: (holding b40) (clear b98)
   goals met: 3 of 7
8. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 7
9. (unstack b81 b22)
   deleted: (on b81 b22) (clear b81) (arm-empty)
   added: (holding b81) (clear b22)
   goals met: 3 of 7
10. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 3 of 7
11. (unstack b22 b110)
   deleted: (on b22 b110) (clear b22) (arm-empty)
   added: (holding b22) (clear b110)
   goals met: 3 of 7
12. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 3 of 7
13. (unstack b110 b1)
   deleted: (on b110 b1) (clear b110) (arm-empty)
   added: (holding b110) (clear b1)
   goals met: 4 of 7
14. (putdown b110)
   deleted: (holding b110)
   added: (clear b110) (arm-empty) (on-table b110)
   goals met: 4 of 7
15. (unstack b85 b70)
   deleted: (on b85 b70) (clear b85) (arm-empty)
   added: (holding b85) (clear b70)
   goals met: 4 of 7
16. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 4 of 7
17. (unstack b70 b2)
   deleted: (on b70 b2) (clear b70) (arm-empty)
   added: (holding b70) (clear b2)
   goals met: 4 of 7
18. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 4 of 7
19. (unstack b98 b26)
   deleted: (on b98 b26) (clear b98) (arm-empty)
   added: (holding b98) (clear b26)
   goals met: 4 of 7
20. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 4 of 7
21. (unstack b26 b57)
   deleted: (on b26 b57) (clear b26) (arm-empty)
   added: (holding b26) (clear b57)
   goals met: 4 of 7
22. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 4 of 7
23. (unstack b57 b127)
   deleted: (on b57 b127) (clear b57) (arm-empty)
   added: (holding b57) (clear b127)
   goals met: 4 of 7
24. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 4 of 7
25. (unstack b127 b145)
   deleted: (on b127 b145) (clear b127) (arm-empty)
   added: (holding b127) (clear b145)
   goals met: 4 of 7
26. (putdown b127)
   deleted: (holding b127)
   added: (clear b127) (arm-empty) (on-table b127)
   goals met: 4 of 7
27. (unstack b145 b120)
   deleted: (on b145 b120) (clear b145) (arm-empty)
   added: (holding b145) (clear b120)
   goals met: 4 of 7
28. (putdown b145)
   deleted: (holding b145)
   added: (clear b145) (arm-empty) (on-table b145)
   goals met: 4 of 7
29. (unstack b120 b3)
   deleted: (on b120 b3) (clear b120) (arm-empty)
   added: (holding b120) (clear b3)
   goals met: 5 of 7
30. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 5 of 7
31. (unstack b3 b142)
   deleted: (on b3 b142) (clear b3) (arm-empty)
   added: (holding b3) (clear b142)
   goals met: 4 of 7
32. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 7
33. (unstack b4 b21)
   deleted: (on b4 b21) (clear b4) (arm-empty)
   added: (holding b4) (clear b21)
   goals met: 5 of 7
34. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 7 of 7
